<!--
  ~ Infomaniak kDrive - Desktop
  ~ Copyright (C) 2023-2025 Infomaniak Network SA
  ~
  ~ This program is free software: you can redistribute it and/or modify
  ~ it under the terms of the GNU General Public License as published by
  ~ the Free Software Foundation, either version 3 of the License, or
  ~ (at your option) any later version.
  ~
  ~ This program is distributed in the hope that it will be useful,
  ~ but WITHOUT ANY WARRANTY; without even the implied warranty of
  ~ MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
  ~ GNU General Public License for more details.
  ~
  ~ You should have received a copy of the GNU General Public License
  ~ along with this program.  If not, see <http://www.gnu.org/licenses/>.
  -->
<!DOCTYPE html>
<html>
 <body>
  <h1>
   Notas de la versi&oacute;n - kDrive 3.7.6
  </h1>
  <h2>
   <b>
    Correcci&oacute;n de errores
   </b>
  </h2>
  <ul>
   <li>
    Corregidos los bucles de sincronizaci&oacute;n debidos a la resoluci&oacute;n incorrecta de conflictos EDIT-DELETE.
   </li>
   <li>
    Corregidos los bucles de sincronizaci&oacute;n debidos a fechas de creaci&oacute;n nulas de las carpetas.
   </li>
   <li>
    Corregidos los bucles de sincronizaci&oacute;n causados por la destrucci&oacute;n y reconstrucci&oacute;n de una rama en la jerarqu&iacute;a de carpetas de sincronizaci&oacute;n.
   </li>
   <li>
    Corregida la actualizaci&oacute;n de la lista de carpetas excluidas por el usuario.
   </li>
   <li>
    Correcci&oacute;n de los bucles de sincronizaci&oacute;n provocados por la gesti&oacute;n incorrecta de las fechas de modificaci&oacute;n en los sistemas FAT.
   </li>
   <li>
    Corregidas las fechas de creaci&oacute;n incorrectas establecidas tras la edici&oacute;n local.
   </li>
   <li>
    Corregidas las acciones sobre archivos (por ejemplo, hacer disponibles localmente) cuyos nombres contienen caracteres especiales.
   </li>
   <li>
    Correcci&oacute;n de registros truncados.
   </li>
   <li>
    Correcci&oacute;n de bucles de sincronizaci&oacute;n provocados por directorios creados que reutilizaban los identificadores de elementos eliminados.
   </li>
   <li>
    Se ha corregido un error que provocaba que los nombres de archivo que conten&iacute;an un car&aacute;cter de nueva l&iacute;nea no se excluyeran cuando lo solicitaba el usuario.
   </li>
   <li>
    Correcci&oacute;n de los bucles de sincronizaci&oacute;n provocados por un cambio de directorio de sincronizaci&oacute;n.
   </li>
   <li>
    Visualizaci&oacute;n de un error cuando falla la carga de los registros.
   </li>
   <li>
    Corregida la descarga de archivos bundle.
   </li>
  </ul>
 </body>
</html>
