<!--
  ~ Infomaniak kDrive - Desktop
  ~ Copyright (C) 2023-2025 Infomaniak Network SA
  ~
  ~ This program is free software: you can redistribute it and/or modify
  ~ it under the terms of the GNU General Public License as published by
  ~ the Free Software Foundation, either version 3 of the License, or
  ~ (at your option) any later version.
  ~
  ~ This program is distributed in the hope that it will be useful,
  ~ but WITHOUT ANY WARRANTY; without even the implied warranty of
  ~ MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
  ~ GNU General Public License for more details.
  ~
  ~ You should have received a copy of the GNU General Public License
  ~ along with this program.  If not, see <http://www.gnu.org/licenses/>.
  -->
<!DOCTYPE html>
<html>
 <body>
  <h1>
   Notes de version - kDrive 3.7.6
  </h1>
  <h2>
   <b>
    Correction de bugs
   </b>
  </h2>
  <ul>
   <li>
    Correction des boucles de synchronisation dues &agrave; une r&eacute;solution incorrecte des conflits EDIT-DELETE.
   </li>
   <li>
    Correction des boucles de synchronisation dues &agrave; des dates de cr&eacute;ation de dossiers nulles.
   </li>
   <li>
    Correction des boucles de synchronisation caus&eacute;es par la destruction et la reconstruction d'une branche dans la hi&eacute;rarchie des dossiers de synchronisation.
   </li>
   <li>
    Correction de la mise &agrave; jour de la liste des dossiers exclus par l'utilisateur.
   </li>
   <li>
    Correction des boucles de synchronisation caus&eacute;es par la gestion incorrecte des dates de modification sur les syst&egrave;mes FAT.
   </li>
   <li>
    Correction des dates de cr&eacute;ation incorrectes d&eacute;finies apr&egrave;s une modification locale.
   </li>
   <li>
    Correction des actions sur les fichiers (par exemple, rendre disponible localement) dont les noms contiennent des caract&egrave;res sp&eacute;ciaux.
   </li>
   <li>
    Correction des journaux tronqu&eacute;s.
   </li>
   <li>
    Correction des boucles de synchronisation caus&eacute;es par les r&eacute;pertoires cr&eacute;&eacute;s r&eacute;utilisant les identifiants des &eacute;l&eacute;ments supprim&eacute;s.
   </li>
   <li>
    Correction d'un bogue entra&icirc;nant l'exclusion des noms de fichiers contenant un caract&egrave;re de nouvelle ligne &agrave; la demande de l'utilisateur.
   </li>
   <li>
    Correction des boucles de synchronisation caus&eacute;es par un changement de r&eacute;pertoire de synchronisation.
   </li>
   <li>
    Affichage d'une erreur lorsque le t&eacute;l&eacute;chargement des journaux &eacute;choue.
   </li>
   <li>
    Correction du t&eacute;l&eacute;chargement des fichiers bundle.
   </li>
  </ul>
 </body>
</html>
