<!--
  ~ Infomaniak kDrive - Desktop
  ~ Copyright (C) 2023-2024 Infomaniak Network SA
  ~
  ~ This program is free software: you can redistribute it and/or modify
  ~ it under the terms of the GNU General Public License as published by
  ~ the Free Software Foundation, either version 3 of the License, or
  ~ (at your option) any later version.
  ~
  ~ This program is distributed in the hope that it will be useful,
  ~ but WITHOUT ANY WARRANTY; without even the implied warranty of
  ~ MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
  ~ GNU General Public License for more details.
  ~
  ~ You should have received a copy of the GNU General Public License
  ~ along with this program.  If not, see <http://www.gnu.org/licenses/>.
  -->

<!DOCTYPE html>
<html>
<body>
<h1>Notas de la versi&oacute;n - kDrive 3.6.0</h1>
<h2><b>Novedades</b></h2>
  <ul>
    <li>Sincronizaci&oacute;n de enlaces (enlaces simb&oacute;licos y alias)</li>
    <li>Protecci&oacute;n a&ntilde;adida para evitar que se sincronicen 2 sincronizaciones dentro de la misma carpeta.</li>
    <li>Ahora los registros se conservan durante 7 d&iacute;as en lugar de 24.</li>
  </ul>
<h2><b>Correcci&oacute;n de errores</b></h2>
  <ul>
    <li>Corregidas las opciones de lanzamiento --synthesis y --settings</li>
    <li>Se ha corregido un problema del generador de operaciones cuando un elemento con la operaci&oacute;n DELETE est&aacute; en la lista negra.</li>
    <li>Corregido un fallo en el Gestor de Trabajos</li>
    <li>Se ha corregido un fallo en el Ejecutor cuando se reconstruye la instant&aacute;nea local.</li>
    <li>Se ha corregido un problema que provocaba el vaciado de la carpeta local al cambiar los derechos en el kDrive.</li>
    <li>Se ha corregido un problema que se produc&iacute;a al eliminar una sincronizaci&oacute;n durante la sincronizaci&oacute;n.</li>
    <li>Se ha solucionado un problema que se produc&iacute;a durante las cargas masivas</li>
    <li>Corregido el mensaje que informaba de un archivo demasiado grande</li>
    <li>Corregida la migraci&oacute;n si hay un acento en la ruta de inicio del usuario</li>
    <li>Se ha corregido un problema de sincronizaci&oacute;n en Office y programas similares debido a que no se detectaban las operaciones de SUPR.</li>
    <li>Se ha corregido un problema de sincronizaci&oacute;n con Pro Tools y programas similares.</li>
    <li>Corregida la sincronizaci&oacute;n que no funcionaba en discos FAT</li>
    <li>Corregido un conflicto entre un archivo y un directorio</li>
    <li>Corregido un fallo cuando hay 2 archivos con el mismo nombre pero diferentes codificaciones.</li>
    <li>Corregido un bucle de sincronizaci&oacute;n debido a un problema de casos</li>
    <li>Solucionado un problema de conflicto entre Editar y Mover</li>
    <li>Sincronizar selecci&oacute;n de carpetas - Mostrar advertencia s&oacute;lo cuando se anula la selecci&oacute;n</li>
    <li>Mostrar un mensaje expl&iacute;cito si se ha alcanzado la cuota de kDrive</li>
    <li>LiteSync - Evitar hidrataciones no deseadas</li>
  </ul>
</body>
</html>
