<!--
  ~ Infomaniak kDrive - Desktop
  ~ Copyright (C) 2023-2024 Infomaniak Network SA
  ~
  ~ This program is free software: you can redistribute it and/or modify
  ~ it under the terms of the GNU General Public License as published by
  ~ the Free Software Foundation, either version 3 of the License, or
  ~ (at your option) any later version.
  ~
  ~ This program is distributed in the hope that it will be useful,
  ~ but WITHOUT ANY WARRANTY; without even the implied warranty of
  ~ MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
  ~ GNU General Public License for more details.
  ~
  ~ You should have received a copy of the GNU General Public License
  ~ along with this program.  If not, see <http://www.gnu.org/licenses/>.
  -->

<!DOCTYPE html>
<html>
<body>
<h1>Notes de version - kDrive 3.6.3</h1>
<h2><b>Nouvelles fonctionnalit&eacute;s</b></h2>
  <ul>
    <li>R&eacute;vision de l'envoi des logs &agrave; l'assistance</li>
  </ul>
<h2><b>Correction de bugs</b></h2>
  <ul>
    <li>Correction d'un probl&egrave;me de synchronisation &agrave; l'&eacute;tape 3 qui provoquait le red&eacute;marrage de la synchronisation</li>
    <li>Correction d'un probl&egrave;me entra&icirc;nant l'interruption de la synchronisation pendant l'&eacute;tape de propagation</li>
    <li>Correction de probl&egrave;mes lors de t&eacute;l&eacute;chargements massifs.</li>
    <li>Correction de la synchronisation des fichiers dont les noms contiennent des caract&egrave;res sp&eacute;ciaux tels que des guillemets doubles, des barres obliques invers&eacute;es ou des nouvelles lignes.</li>
    <li>Correction d'un probl&egrave;me de synchronisation apr&egrave;s avoir renomm&eacute; un fichier sur le kDrive, ce qui provoquait un "conflit de nom".</li>
    <li>Correction d'un probl&egrave;me de synchronisation avec des fichiers ayant une date de modification erron&eacute;e, que l'application essayait syst&eacute;matiquement de recharger.</li>
    <li>Correction de la r&eacute;solution de conflit de "Move-ParentDelete</li>
		<li>Correction d'un probl&egrave;me de synchronisation avec les fichiers dont les noms sont cod&eacute;s en NFD</li>
		<li>Am&eacute;lioration des performances de la gestion des droits pour les PC sur un r&eacute;seau Windows Server</li>
		<li>Correction d'un probl&egrave;me d'obtention du chemin du dossier de configuration en cas de red&eacute;finition de la variable de configuration TMP</li>
    <li>Correction d'un crash lors de la suppression de la synchronisation</li>
    <li>Ajout d'une protection pour emp&ecirc;cher la cr&eacute;ation de synchronisations imbriqu&eacute;es</li>
    <li>Correction de l'archivage des anciens fichiers journaux</li>
    <li>Correction du style de la barre de progression dans l'assistant de mise &agrave; jour de la synchronisation</li>
    <li>Correction de la date des erreurs toujours au format anglais</li>
    <li>Correction des couleurs dans la fen&ecirc;tre de r&eacute;solution des conflits si le th&egrave;me sombre est activ&eacute;</li>
  </ul>
</body>
</html>