<!--
  ~ Infomaniak kDrive - Desktop
  ~ Copyright (C) 2023-2024 Infomaniak Network SA
  ~
  ~ This program is free software: you can redistribute it and/or modify
  ~ it under the terms of the GNU General Public License as published by
  ~ the Free Software Foundation, either version 3 of the License, or
  ~ (at your option) any later version.
  ~
  ~ This program is distributed in the hope that it will be useful,
  ~ but WITHOUT ANY WARRANTY; without even the implied warranty of
  ~ MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
  ~ GNU General Public License for more details.
  ~
  ~ You should have received a copy of the GNU General Public License
  ~ along with this program.  If not, see <http://www.gnu.org/licenses/>.
  -->

<!DOCTYPE html>
<html>
<body>
<h1>Notas de la versi&oacute;n - kDrive 3.6.3</h1>
<h2><b>Novedades</b></h2>
  <ul>
    <li>Revisi&oacute;n del env&iacute;o de registros a soporte</li>
  </ul>
<h2><b>Correcci&oacute;n de errores</b></h2>
  <ul>
    <li>Se ha corregido un problema de sincronizaci&oacute;n en el paso 3 que provocaba el reinicio de la sincronizaci&oacute;n.</li>
    <li>Se ha corregido un problema que provocaba la interrupci&oacute;n de la sincronizaci&oacute;n durante el paso de propagaci&oacute;n.</li>
    <li>Se han solucionado problemas durante cargas/descargas masivas.</li>
    <li>Se ha corregido la sincronizaci&oacute;n de archivos cuyos nombres contienen caracteres especiales como comillas dobles, barras invertidas o nuevas l&iacute;neas.</li>
    <li>Arreglado el problema de sincronizaci&oacute;n tras renombrar un archivo en el kDrive que provocaba un "choque de nombres"</li>
    <li>Se ha corregido un problema de sincronizaci&oacute;n con archivos que ten&iacute;an una fecha de modificaci&oacute;n falsa y que la aplicaci&oacute;n intentaba volver a cargar sistem&aacute;ticamente.</li>
    <li>Corregida la resoluci&oacute;n de conflictos de "Move-ParentDelete".</li>
    <li>Corregido un fallo al eliminar la sincronizaci&oacute;n</li>
    <li>Protecci&oacute;n a&ntilde;adida para evitar la creaci&oacute;n de sincronizaciones anidadas</li>
    <li>Arreglado el archivado de ficheros de registro antiguos</li>
    <li>Correcci&oacute;n del estilo de la barra de progreso en el asistente de actualizaci&oacute;n de la sincronizaci&oacute;n.</li>
    <li>Corregida la fecha de los errores siempre en formato ingl&eacute;s</li>
    <li>Corregidos los colores en la ventana de resoluci&oacute;n de conflictos si se activa el tema oscuro</li>
		<li>Solucionado un problema de traducci&oacute;n del men&uacute; principal</li>
  </ul>
</body>
</html>